#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиГита = SslCI_СлужебныйВызовСервера.ПолучитьТекущиеНастройкиИнтеграции();
	
	Если НастройкиГита <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиГита);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресГитаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТокенДоступаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КаталогИсходниковПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИдПроектаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресТаскТрекераПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксЗадачиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РучноеДобавлениеФайловПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		НастройкиГита = НастройкиГита();
		
		Если SslCI_НастройкаИнтеграцииСГитомПовтИсп.СоединениеСГитомУстановлено(НастройкиГита, Истина) Тогда
			ДанныеПроекта = SslCI_РаботаСГитом.ИнфоОПроекте(НастройкиГита);
			
			Если ДанныеПроекта.Успех = Истина Тогда
				Если ПутьКРепозиторию <> ДанныеПроекта.ОписаниеПроекта.web_url Тогда 
					ПутьКРепозиторию = ДанныеПроекта.ОписаниеПроекта.web_url;
					Модифицированность = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		SslCI_СлужебныйВызовСервера.ЗаписатьНастройкиИнтеграции(НастройкиГита());
		ОбновитьПовторноИспользуемыеЗначения();
		Оповестить("ОбновлениеНастроекГита");		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НастройкиГита()

	НастройкиГита = Новый Структура;
	НастройкиГита.Вставить("АдресГита", 				АдресГита);
	НастройкиГита.Вставить("ИдПроекта", 				ИдПроекта);
	НастройкиГита.Вставить("ТокенДоступа", 				ТокенДоступа);
	НастройкиГита.Вставить("КаталогИсходников", 		КаталогИсходников);
	НастройкиГита.Вставить("АдресТаскТрекера", 			АдресТаскТрекера);
	НастройкиГита.Вставить("ПрефиксЗадачи", 			ПрефиксЗадачи);
	НастройкиГита.Вставить("ПутьКРепозиторию", 			ПутьКРепозиторию);
	НастройкиГита.Вставить("РучноеДобавлениеФайлов", 	РучноеДобавлениеФайлов);
	
	Возврат НастройкиГита;
	
КонецФункции

#КонецОбласти