#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Реквизиты = SslCI_СлужебныйВызовСервера.РеквизитыОбъекта(ПараметрКоманды, "ЭтоГруппа");
	
	Если Реквизиты.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Ссылка", ПараметрКоманды);	
	Оповещение = Новый ОписаниеОповещения("ВыборВеткиПродолжение", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыПодбора = Новый Структура("БезОповещения", Истина);
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.Форма.SslCI_ПереключениеВетки", ПараметрыПодбора, 
		ПараметрыВыполненияКоманды.Источник, Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВеткиПродолжение(Результат, ДопПараметры) Экспорт
	
	ТекСсылка = Неопределено;
	Если Результат <> Неопределено
		И ДопПараметры.Свойство("Ссылка", ТекСсылка) Тогда
		
		SslCI_СлужебныйВызовСервера.ПереключитьВетку(ТекСсылка, Результат);
		SslCI_РаботаСГитом.ОбновитьИзРепозитория(ТекСсылка);
		
		ОповеститьОбИзменении(ТекСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   